; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p13---int100n150-m25---int100c110---s285---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level10 level10)
(sum level0 level12 level12)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level24 level24)
(sum level1 level5 level6)
(sum level1 level10 level11)
(sum level1 level12 level13)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level24 level25)
(sum level2 level5 level7)
(sum level2 level10 level12)
(sum level2 level12 level14)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level24 level26)
(sum level3 level5 level8)
(sum level3 level10 level13)
(sum level3 level12 level15)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level24 level27)
(sum level4 level5 level9)
(sum level4 level10 level14)
(sum level4 level12 level16)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level24 level28)
(sum level5 level5 level10)
(sum level5 level10 level15)
(sum level5 level12 level17)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level24 level29)
(sum level6 level5 level11)
(sum level6 level10 level16)
(sum level6 level12 level18)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level24 level30)
(sum level7 level5 level12)
(sum level7 level10 level17)
(sum level7 level12 level19)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level24 level31)
(sum level8 level5 level13)
(sum level8 level10 level18)
(sum level8 level12 level20)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level24 level32)
(sum level9 level5 level14)
(sum level9 level10 level19)
(sum level9 level12 level21)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level24 level33)
(sum level10 level5 level15)
(sum level10 level10 level20)
(sum level10 level12 level22)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level24 level34)
(sum level11 level5 level16)
(sum level11 level10 level21)
(sum level11 level12 level23)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level24 level35)
(sum level12 level5 level17)
(sum level12 level10 level22)
(sum level12 level12 level24)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level24 level36)
(sum level13 level5 level18)
(sum level13 level10 level23)
(sum level13 level12 level25)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level24 level37)
(sum level14 level5 level19)
(sum level14 level10 level24)
(sum level14 level12 level26)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level24 level38)
(sum level15 level5 level20)
(sum level15 level10 level25)
(sum level15 level12 level27)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level24 level39)
(sum level16 level5 level21)
(sum level16 level10 level26)
(sum level16 level12 level28)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level24 level40)
(sum level17 level5 level22)
(sum level17 level10 level27)
(sum level17 level12 level29)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level24 level41)
(sum level18 level5 level23)
(sum level18 level10 level28)
(sum level18 level12 level30)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level24 level42)
(sum level19 level5 level24)
(sum level19 level10 level29)
(sum level19 level12 level31)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level24 level43)
(sum level20 level5 level25)
(sum level20 level10 level30)
(sum level20 level12 level32)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level24 level44)
(sum level21 level5 level26)
(sum level21 level10 level31)
(sum level21 level12 level33)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level24 level45)
(sum level22 level5 level27)
(sum level22 level10 level32)
(sum level22 level12 level34)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level24 level46)
(sum level23 level5 level28)
(sum level23 level10 level33)
(sum level23 level12 level35)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level24 level47)
(sum level24 level5 level29)
(sum level24 level10 level34)
(sum level24 level12 level36)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level24 level48)
(sum level25 level5 level30)
(sum level25 level10 level35)
(sum level25 level12 level37)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level24 level49)
(sum level26 level5 level31)
(sum level26 level10 level36)
(sum level26 level12 level38)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level24 level50)
(sum level27 level5 level32)
(sum level27 level10 level37)
(sum level27 level12 level39)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level24 level51)
(sum level28 level5 level33)
(sum level28 level10 level38)
(sum level28 level12 level40)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level24 level52)
(sum level29 level5 level34)
(sum level29 level10 level39)
(sum level29 level12 level41)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level24 level53)
(sum level30 level5 level35)
(sum level30 level10 level40)
(sum level30 level12 level42)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level24 level54)
(sum level31 level5 level36)
(sum level31 level10 level41)
(sum level31 level12 level43)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level24 level55)
(sum level32 level5 level37)
(sum level32 level10 level42)
(sum level32 level12 level44)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level24 level56)
(sum level33 level5 level38)
(sum level33 level10 level43)
(sum level33 level12 level45)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level24 level57)
(sum level34 level5 level39)
(sum level34 level10 level44)
(sum level34 level12 level46)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level24 level58)
(sum level35 level5 level40)
(sum level35 level10 level45)
(sum level35 level12 level47)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level24 level59)
(sum level36 level5 level41)
(sum level36 level10 level46)
(sum level36 level12 level48)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level24 level60)
(sum level37 level5 level42)
(sum level37 level10 level47)
(sum level37 level12 level49)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level24 level61)
(sum level38 level5 level43)
(sum level38 level10 level48)
(sum level38 level12 level50)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level24 level62)
(sum level39 level5 level44)
(sum level39 level10 level49)
(sum level39 level12 level51)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level24 level63)
(sum level40 level5 level45)
(sum level40 level10 level50)
(sum level40 level12 level52)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level24 level64)
(sum level41 level5 level46)
(sum level41 level10 level51)
(sum level41 level12 level53)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level24 level65)
(sum level42 level5 level47)
(sum level42 level10 level52)
(sum level42 level12 level54)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level24 level66)
(sum level43 level5 level48)
(sum level43 level10 level53)
(sum level43 level12 level55)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level24 level67)
(sum level44 level5 level49)
(sum level44 level10 level54)
(sum level44 level12 level56)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level24 level68)
(sum level45 level5 level50)
(sum level45 level10 level55)
(sum level45 level12 level57)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level24 level69)
(sum level46 level5 level51)
(sum level46 level10 level56)
(sum level46 level12 level58)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level24 level70)
(sum level47 level5 level52)
(sum level47 level10 level57)
(sum level47 level12 level59)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level24 level71)
(sum level48 level5 level53)
(sum level48 level10 level58)
(sum level48 level12 level60)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level24 level72)
(sum level49 level5 level54)
(sum level49 level10 level59)
(sum level49 level12 level61)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level49 level24 level73)
(sum level50 level5 level55)
(sum level50 level10 level60)
(sum level50 level12 level62)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level51 level5 level56)
(sum level51 level10 level61)
(sum level51 level12 level63)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level52 level5 level57)
(sum level52 level10 level62)
(sum level52 level12 level64)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level53 level5 level58)
(sum level53 level10 level63)
(sum level53 level12 level65)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level54 level5 level59)
(sum level54 level10 level64)
(sum level54 level12 level66)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level55 level5 level60)
(sum level55 level10 level65)
(sum level55 level12 level67)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level56 level5 level61)
(sum level56 level10 level66)
(sum level56 level12 level68)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level57 level5 level62)
(sum level57 level10 level67)
(sum level57 level12 level69)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level58 level5 level63)
(sum level58 level10 level68)
(sum level58 level12 level70)
(sum level58 level15 level73)
(sum level59 level5 level64)
(sum level59 level10 level69)
(sum level59 level12 level71)
(sum level60 level5 level65)
(sum level60 level10 level70)
(sum level60 level12 level72)
(sum level61 level5 level66)
(sum level61 level10 level71)
(sum level61 level12 level73)
(sum level62 level5 level67)
(sum level62 level10 level72)
(sum level63 level5 level68)
(sum level63 level10 level73)
(sum level64 level5 level69)
(sum level65 level5 level70)
(sum level66 level5 level71)
(sum level67 level5 level72)
(sum level68 level5 level73)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l3)
(fuelcost level5 l0 l3)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l4)
(fuelcost level24 l1 l4)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l3)
(fuelcost level16 l2 l3)
(connected l2 l4)
(fuelcost level12 l2 l4)
(connected l3 l0)
(fuelcost level5 l3 l0)
(connected l3 l2)
(fuelcost level16 l3 l2)
(connected l3 l4)
(fuelcost level10 l3 l4)
(connected l4 l1)
(fuelcost level24 l4 l1)
(connected l4 l2)
(fuelcost level12 l4 l2)
(connected l4 l3)
(fuelcost level10 l4 l3)

(at t0 l2)
(fuel t0 level73)
(= (total-cost) 0)

(at p0 l4)
(at p1 l0)
(at p2 l2)
(at p3 l0)
(at p4 l3)
(at p5 l0)
(at p6 l0)
(at p7 l3)
(at p8 l1)
(at p9 l0)
(at p10 l3)
(at p11 l3)
(at p12 l4)
)

(:goal
(and
(at p0 l0)
(at p1 l4)
(at p2 l0)
(at p3 l2)
(at p4 l2)
(at p5 l2)
(at p6 l3)
(at p7 l4)
(at p8 l0)
(at p9 l1)
(at p10 l1)
(at p11 l1)
(at p12 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 13
2. (drive t0 l2 l3 level57 level16 level73)
   deleted: (at t0 l2) (fuel t0 level73)
   added: (at t0 l3) (fuel t0 level57)
   goals met: 0 of 13
3. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 13
4. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 13
5. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 13
6. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 0 of 13
7. (drive t0 l3 l0 level52 level5 level57)
   deleted: (at t0 l3) (fuel t0 level57)
   added: (at t0 l0) (fuel t0 level52)
   goals met: 0 of 13
8. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 13
9. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 13
10. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 13
11. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 13
12. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 13
13. (drive t0 l0 l1 level37 level15 level52)
   deleted: (at t0 l0) (fuel t0 level52)
   added: (at t0 l1) (fuel t0 level37)
   goals met: 0 of 13
14. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 13
15. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 1 of 13
16. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 2 of 13
17. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 3 of 13
18. (drive t0 l1 l2 level32 level5 level37)
   deleted: (at t0 l1) (fuel t0 level37)
   added: (at t0 l2) (fuel t0 level32)
   goals met: 3 of 13
19. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 4 of 13
20. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 5 of 13
21. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 6 of 13
22. (drive t0 l2 l4 level20 level12 level32)
   deleted: (at t0 l2) (fuel t0 level32)
   added: (at t0 l4) (fuel t0 level20)
   goals met: 6 of 13
23. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 6 of 13
24. (load p12 t0 l4)
   deleted: (at p12 l4)
   added: (in p12 t0)
   goals met: 6 of 13
25. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 7 of 13
26. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 8 of 13
27. (drive t0 l4 l3 level10 level10 level20)
   deleted: (at t0 l4) (fuel t0 level20)
   added: (at t0 l3) (fuel t0 level10)
   goals met: 8 of 13
28. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 9 of 13
29. (drive t0 l3 l0 level5 level5 level10)
   deleted: (at t0 l3) (fuel t0 level10)
   added: (at t0 l0) (fuel t0 level5)
   goals met: 9 of 13
30. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 10 of 13
31. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 11 of 13
32. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 12 of 13
33. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 13 of 13
